app/controllers/api/lists_controller.rb

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @list = List.find_by(id: params[:id])

INSERT INTO "lists" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Test list 1"], ["created_at", "2021-07-29 09:59:34.409880"], ["updated_at", "2021-07-29 09:59:34.409880"]]
---
  def create
    @list = List.new(list_params)
    @list.save!

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "lists" WHERE "lists"."id" = $1  [["id", 2]]
---
  def destroy
    @list = List.find_by(id: params[:id])
    @list.destroy!