app/controllers/api/list_items_controller.rb

INSERT INTO "list_items" ("menu_item_id", "list_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["menu_item_id", 1], ["list_id", 7], ["created_at", "2021-07-30 02:47:51.845700"], ["updated_at", "2021-07-30 02:47:51.845700"]]
---
  def create
    @list_item = ListItem.new(list_item_params)
    @list_item.save!

SELECT  "list_items".* FROM "list_items" WHERE "list_items"."menu_item_id" = $1 AND "list_items"."list_id" = $2 LIMIT $3  [["menu_item_id", 1], ["list_id", 14], ["LIMIT", 1]]
DELETE FROM "list_items" WHERE "list_items"."id" = $1  [["id", 9]]
---
  def destroy
    @list_item = ListItem.find_by(
      menu_item_id: params[:menu_item_id],
      list_id: params[:list_id]
    )
    @list_item.destroy!