app/controllers/api/menu_items_controller.rb

  def index
    if params[:list_id]
      @menu_items = MenuItem.joins(list_items: :list).where(lists: {id: params[:list_id]})
    else
      @menu_items = MenuItem.all
---
SELECT "menu_items".* FROM "menu_items" INNER JOIN "list_items" ON "list_items"."menu_item_id" = "menu_items"."id" INNER JOIN "lists" ON "lists"."id" = "list_items"."list_id" WHERE "lists"."id" = $1  [["id", 1]]
SELECT "lists".* FROM "lists"
SELECT "menu_items".* FROM "menu_items"