app/models/menu_item.rb

  def self.import(file)
    CSV.foreach(file.path, headers: true) do |row|
      MenuItem.create! row.to_hash
---
INSERT INTO "menu_items" ("name", "description", "category", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"